# Курс основы программирования на Python
# Задание по программированию: Замена подстроки
# 27.04.2019
#
# Дана строка. Замените в этой строке все цифры 1 на слово one.
#
# Формат ввода
#
# Вводится строка.
#
# Формат вывода
#
# Выведите ответ на задачу.

a = str(input())
print(a.replace('1', 'one'))
