# Курс основы программирования на Python
# Задание по программированию: Удаление символа
# 27.04.2019
#
# Дана строка. Удалите из этой строки все символы @.
#
# Формат ввода
#
# Вводится строка.
#
# Формат вывода
#
# Выведите ответ на задачу.

a = str(input())
print(a.replace('@', ''))
